The scripts here are to be used with Sage.

Run Sage in the directory with these scripts, then do:
  sage: load "polynomial.py"


Examples

Simple example:
  sage: irreducible_polynomial(4) # Returns an irreducible polynomial of degree 4

Generating Normalized roots:

# This sets x as an element of polynomial ring over rationals

  sage: R.<x> = QQ[]  
  sage: f = x^2 + 1

# If you have TransitiveGroup installed, this should return an id of galois
# group of f. 
# You can install this optional sage package by running: 
#   sage -i database_gap-4.4.10

  sage: f.galois_group() 

# This gives a list of normalized roots mod p for 10 prime numbers p starting
# with 2

  sage: roots_modp(f,2,10)
